       identification division.
       program-id. hola.

       procedure division.
           display "¡El hola mundo en gnu cobol!".
           exit program.
