       identification division.
       program-id. debug.

       procedure division.
           display "Este es un programa placeholder a depurar".
           exit program.
